"use strict";

var zp = prompt("\u0412\u0432\u0435\u0434\u0438\u0442\u0435 \u0441\u0443\u043C\u043C\u0443 \u0432\u0430\u0448\u0435\u0439 \u043C\u0435\u0441\u044F\u0447\u043D\u043E\u0439 \u0437\u0430\u0440\u043F\u043B\u0430\u0442\u044B "); //let zpnum = Number{zp};

var zp1 = zp * 0.1;
var zp2 = zp * 0.15;
var zp3 = zp * 0.175;
var zp4 = zp * 0.2; //(zp < 6000) || (zp = 6000) (zp <= 6000)

if (zp < 6000 || zp == 6000) {
  document.write("\u041F\u0435\u0440\u0435\u0447\u0438\u0441\u043B\u044F\u0435\u043C \u043D\u0430 \u043D\u0430\u043B\u043E\u0433\u0438 - " + zp1), document.write(",  \u041F\u043E\u043B\u0443\u0447\u0430\u0435\u0442\u0435 \u043D\u0430 \u0440\u0443\u043A\u0438 \u0447\u0438\u0441\u0442\u044B\u043C\u0438 - " + "".concat(zp - zp1));
} else if (zp <= 10000) {
  document.write("\u041F\u0435\u0440\u0435\u0447\u0438\u0441\u043B\u044F\u0435\u0442\u0435 \u043D\u0430 \u043D\u0430\u043B\u043E\u0433\u0438 - " + zp2);
  document.write(",  \u041F\u043E\u043B\u0443\u0447\u0430\u0435\u0442\u0435 \u043D\u0430 \u0440\u0443\u043A\u0438 \u0447\u0438\u0441\u0442\u044B\u043C\u0438 - " + "".concat(zp - zp2));
} else if (zp <= 15000) {
  document.write("\u041F\u0435\u0440\u0435\u0447\u0438\u0441\u043B\u044F\u0442\u0435 \u043D\u0430 \u043D\u0430\u043B\u043E\u0433\u0438 - " + zp3);
  document.write(",  \u041F\u043E\u043B\u0443\u0447\u0430\u0435\u0442\u0435 \u043D\u0430 \u0440\u0443\u043A\u0438 \u0447\u0438\u0441\u0442\u044B\u043C\u0438 - " + "".concat(zp - zp3));
} else if (zp >= 15001) {
  document.write("\u041F\u0435\u0440\u0435\u0447\u0438\u0441\u043B\u044F\u0442\u0435 \u043D\u0430 \u043D\u0430\u043B\u043E\u0433\u0438 - " + zp4);
  document.write(",  \u041F\u043E\u043B\u0443\u0447\u0430\u0435\u0442\u0435 \u043D\u0430 \u0440\u0443\u043A\u0438 \u0447\u0438\u0441\u0442\u044B\u043C\u0438 - " + "".concat(zp - zp4));
}

;
/*Задача 6. Несколько условий. Лестница if...else

Попросите пользователя ввести размер его зарплаты. Рассчитайте, какую сумму он должен перечислить на налог и какую сумму он получит на руки, если налоги начисляются таким образом:

Зарплата до 6000 включительно - 10%;
Зарплата до 10 000 включительно - 15%;
Зарплата до 15 000 включительно - 17.5%;
Зарплата свыше 15 000 - 20%.
Используйте множественные условия для проверки диапазона введенных пользователем данных. */